Ebiroll/qemu_esp32/examples/32_lora/components/lora/esp32LoRa.cpp
#if 0
/*
 *  Library for LoRa 868 / 915MHz SX1272 LoRa module
 *  
 *  Copyright (C) Libelium Comunicaciones Distribuidas S.L. 
 *  http://www.libelium.com 
 *  
 *  This program is free software: you can redistribute it and/or modify 
 *  it under the terms of the GNU General Public License as published by 
 *  the Free Software Foundation, either version 3 of the License, or 
 *  (at your option) any later version. 
 *  
 *  This program is distributed in the hope that it will be useful, 
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of 
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the 
 *  GNU General Public License for more details.
 *  
 *  You should have received a copy of the GNU General Public License 
 *  along with this program.  If not, see http://www.gnu.org/licenses/. 
 *  
 *  Version:           1.4
 *  Design:            David Gascón 
 *  Implementation:    Covadonga Albiñana, Victor Boria, Ruben Martin
 */

//**********************************************************************
// Includes
//**********************************************************************
#include "esp32LoRa.h"
#include <stdio.h>
#include <SPI.h>

//#include "arduPiClasses.h"

//#include "bcm2835.h"

//**********************************************************************
// Public functions.
//**********************************************************************

/*
 Function: Sets the module ON.
 Returns: uint8_t setLORA state
*/
uint8_t SX1272::ON()
{

  uint8_t state = 2;

  #if (SX1272_debug_mode > 1)
	  printf("\n");
	  printf("Starting 'ON'\n");
  #endif

  // Inital Reset Sequence

  #if 0
  // 1.- power ON embebed socket
  Utils.socketON();

  // 2.- reset pulse for LoRa module initialization
  pinMode(LORA_RESET_PIN, OUTPUT);
  digitalWrite(LORA_RESET_PIN, HIGH);
  delay(100);

  digitalWrite(LORA_RESET_PIN, LOW);
  delay(100);

  // 3.- SPI chip select
  pinMode(SX1272_SS,OUTPUT);
  digitalWrite(SX1272_SS,HIGH);
  delayMicroseconds(100);
 
  //Configure the MISO, MOSI, CS, SPCR.
  SPI.begin();
  //Set Most significant bit first
  SPI.setBitOrder(BCM2835_SPI_BIT_ORDER_MSBFIRST);
  //Divide the clock frequency
  SPI.setClockDivider(SPI_CLOCK_DIV64);
  //Set data mode
  SPI.setDataMode(SPI_MODE0);
  delayMicroseconds(100);
  setMaxCurrent(0x1B);
  #if (SX1272_debug_mode > 1)
	  printf("## Setting ON with maximum current supply ##\n");
	  printf("\n");
  #endif

  // set LoRa mode
  state = setLORA();

	//Set initialization values
	writeRegister(0x0,0x0);
	writeRegister(0x1,0x81);
	writeRegister(0x2,0x1A);
	writeRegister(0x3,0xB);
	writeRegister(0x4,0x0);
	writeRegister(0x5,0x52);
	writeRegister(0x6,0xD8);
	writeRegister(0x7,0x99);
	writeRegister(0x8,0x99);
	writeRegister(0x9,0x0);
	writeRegister(0xA,0x9);
	writeRegister(0xB,0x3B);
	writeRegister(0xC,0x23);
	writeRegister(0xD,0x1);
	writeRegister(0xE,0x80);
	writeRegister(0xF,0x0);
	writeRegister(0x10,0x0);
	writeRegister(0x11,0x0);
	writeRegister(0x12,0x0);
	writeRegister(0x13,0x0);
	writeRegister(0x14,0x0);
	writeRegister(0x15,0x0);
	writeRegister(0x16,0x0);
	writeRegister(0x17,0x0);
	writeRegister(0x18,0x10);
	writeRegister(0x19,0x0);
	writeRegister(0x1A,0x0);
	writeRegister(0x1B,0x0);
	writeRegister(0x1C,0x0);
	writeRegister(0x1D,0x4A);
	writeRegister(0x1E,0x97);
	writeRegister(0x1F,0xFF);
	writeRegister(0x20,0x0);
	writeRegister(0x21,0x8);
	writeRegister(0x22,0xFF);
	writeRegister(0x23,0xFF);
	writeRegister(0x24,0x0);
	writeRegister(0x25,0x0);
	writeRegister(0x26,0x0);
	writeRegister(0x27,0x0);
	writeRegister(0x28,0x0);
	writeRegister(0x29,0x0);
	writeRegister(0x2A,0x0);
	writeRegister(0x2B,0x0);
	writeRegister(0x2C,0x0);
	writeRegister(0x2D,0x50);
	writeRegister(0x2E,0x14);
	writeRegister(0x2F,0x40);
	writeRegister(0x30,0x0);
	writeRegister(0x31,0x3);
	writeRegister(0x32,0x5);
	writeRegister(0x33,0x27);
	writeRegister(0x34,0x1C);
	writeRegister(0x35,0xA);
	writeRegister(0x36,0x0);
	writeRegister(0x37,0xA);
	writeRegister(0x38,0x42);
	writeRegister(0x39,0x12);
	writeRegister(0x3A,0x65);
	writeRegister(0x3B,0x1D);
	writeRegister(0x3C,0x1);
	writeRegister(0x3D,0xA1);
	writeRegister(0x3E,0x0);
	writeRegister(0x3F,0x0);
	writeRegister(0x40,0x0);
	writeRegister(0x41,0x0);
	writeRegister(0x42,0x22);
#endif
  return state;
}

/*
 Function: Sets the module OFF.
 Returns: Nothing
*/
void SX1272::OFF()
{
  #if (SX1272_debug_mode > 1)
	  printf("\n");
	  printf("Starting 'OFF'\n");
  #endif

  // Powerdown sequence:

  // 1.- Close SPI
  SPI.end();

  // 2.- Chip Select OFF
  pinMode(SX1272_SS,OUTPUT);
  digitalWrite(SX1272_SS,LOW);

  // 3.- power OFF embebed socket
  Utils.socketOFF();

  #if (SX1272_debug_mode > 1)
	  printf("## Setting OFF ##\n");
	  printf("\n");
  #endif
}

/*
 Function: Reads the indicated register.
 Returns: The content of the register
 Parameters:
   address: address register to read from
*/
byte SX1272::readRegister(byte address)
{
	digitalWrite(SX1272_SS,LOW);
    bitClear(address, 7);		// Bit 7 cleared to write in registers
    //SPI.transfer(address);
    //value = SPI.transfer(0x00);
    txbuf[0] = address;
	txbuf[1] = 0x00;
	maxWrite16();
	digitalWrite(SX1272_SS,HIGH);

    #if (SX1272_debug_mode > 1)
        printf("## Reading:  ##\tRegister ");
		printf("%X", address);
		printf(":  ");
		printf("%X", rxbuf[1]);
		printf("\n");
	#endif

    return rxbuf[1];
}

/*
 Function: Writes on the indicated register.
 Returns: Nothing
 Parameters:
   address: address register to write in
   data : value to write in the register
*/
void SX1272::writeRegister(byte address, byte data)
{
	digitalWrite(SX1272_SS,LOW);
	delayMicroseconds(1);
    bitSet(address, 7);			// Bit 7 set to read from registers
    //SPI.transfer(address);
    //SPI.transfer(data);
    txbuf[0] = address;
	txbuf[1] = data;
	maxWrite16();
	//digitalWrite(SX1272_SS,HIGH);

    #if (SX1272_debug_mode > 1)
        printf("## Writing:  ##\tRegister ");
		bitClear(address, 7);
		printf("%X", address);
		printf(":  ");
		printf("%X", data);
		printf("\n");
	#endif

