Ebiroll/qemu_esp32/examples/32_lora/components/lora/esp32LoRa.cpp
}

/*
 Function: It gets the temperature from the measurement block module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
void SX1272::maxWrite16()
{
	digitalWrite(SX1272_SS,LOW);
	SPI.transfernb(txbuf, rxbuf, 2);
	digitalWrite(SX1272_SS,HIGH);
}

/*
 Function: Clears the interruption flags
 Returns: Nothing
*/
void SX1272::clearFlags()
{
    byte st0;

	st0 = readRegister(REG_OP_MODE);		// Save the previous status

	if( _modem == LORA )
	{ // LoRa mode
		writeRegister(REG_OP_MODE, LORA_STANDBY_MODE);	// Stdby mode to write in registers
		writeRegister(REG_IRQ_FLAGS, 0xFF);	// LoRa mode flags register
		writeRegister(REG_OP_MODE, st0);		// Getting back to previous status
		#if (SX1272_debug_mode > 1)
			printf("## LoRa flags cleared ##\n");
		#endif
	}
	else
	{ // FSK mode
		writeRegister(REG_OP_MODE, FSK_STANDBY_MODE);	// Stdby mode to write in registers
		writeRegister(REG_IRQ_FLAGS1, 0xFF); // FSK mode flags1 register
		writeRegister(REG_IRQ_FLAGS2, 0xFF); // FSK mode flags2 register
		writeRegister(REG_OP_MODE, st0);		// Getting back to previous status
		#if (SX1272_debug_mode > 1)
			printf("## FSK flags cleared ##\n");
		#endif
	}
}

/*
 Function: Sets the module in LoRa mode.
 Returns:  Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::setLORA()
{
    uint8_t state = 2;
    byte st0;

	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'setLORA'\n");
	#endif

	writeRegister(REG_OP_MODE, FSK_SLEEP_MODE);    // Sleep mode (mandatory to set LoRa mode)
	writeRegister(REG_OP_MODE, LORA_SLEEP_MODE);    // LoRa sleep mode
	writeRegister(REG_OP_MODE, LORA_STANDBY_MODE);	// LoRa standby mode

	writeRegister(REG_MAX_PAYLOAD_LENGTH,MAX_LENGTH);

	delayMicroseconds(100);

	st0 = readRegister(REG_OP_MODE);	// Reading config mode
	if( st0 == LORA_STANDBY_MODE )
	{ // LoRa mode
		_modem = LORA;
		state = 0;
		#if (SX1272_debug_mode > 1)
			printf("## LoRa set with success ##\n");
			printf("\n");
		#endif
	}
	else
	{ // FSK mode
		_modem = FSK;
		state = 1;
//		#if (SX1272_debug_mode > 1)
			printf("** There has been an error while setting LoRa **\n");
			printf("\n");
//		#endif
	}
	return state;
}

/*
 Function: Sets the module in FSK mode.
 Returns:   Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::setFSK()
{
	uint8_t state = 2;
    byte st0;
    byte config1;

	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'setFSK'\n");
	#endif

	if(	_modem = LORA )
	{
		writeRegister(REG_OP_MODE, LORA_STANDBY_MODE);
		writeRegister(REG_OP_MODE, LORA_SLEEP_MODE);
	}
	writeRegister(REG_OP_MODE, FSK_SLEEP_MODE);	// Sleep mode (mandatory to change mode)
	writeRegister(REG_OP_MODE, FSK_STANDBY_MODE);	// FSK standby mode
	config1 = readRegister(REG_PACKET_CONFIG1);
	config1 = config1 & 0B01111101;		// clears bits 8 and 1 from REG_PACKET_CONFIG1
	config1 = config1 | 0B00000100;		// sets bit 2 from REG_PACKET_CONFIG1
	writeRegister(REG_PACKET_CONFIG1,config1);	// AddressFiltering = NodeAddress + BroadcastAddress
	writeRegister(REG_FIFO_THRESH, 0x80);	// condition to start packet tx
	config1 = readRegister(REG_SYNC_CONFIG);
	config1 = config1 & 0B00111111;
	writeRegister(REG_SYNC_CONFIG,config1);

	delayMicroseconds(100);

	st0 = readRegister(REG_OP_MODE);	// Reading config mode
	if( st0 == FSK_STANDBY_MODE )
	{ // FSK mode
		_modem = FSK;
		state = 0;
//		#if (SX1272_debug_mode > 1)
			printf("## FSK set with success ##\n");
			printf("\n");
//		#endif
	}
	else
	{ // LoRa mode
		_modem = LORA;
		state = 1;
		#if (SX1272_debug_mode > 1)
			printf("** There has been an error while setting FSK **\n");
			printf("\n");
		#endif
	}
	return state;
}

/*
 Function: Gets the bandwidth, coding rate and spreading factor of the LoRa modulation.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::getMode()
{
  byte st0;
  int8_t state = 2;
  byte value = 0x00;

  #if (SX1272_debug_mode > 1)
	  printf("\n");
	  printf("Starting 'getMode'\n");
  #endif

  st0 = readRegister(REG_OP_MODE);		// Save the previous status
  if( _modem == FSK )
  {
	  setLORA();					// Setting LoRa mode
  }
  value = readRegister(REG_MODEM_CONFIG1);
  _bandwidth = (value >> 6);   			// Storing 2 MSB from REG_MODEM_CONFIG1 (=_bandwidth)
  _codingRate = (value >> 3) & 0x07;  		// Storing third, forth and fifth bits from
  value = readRegister(REG_MODEM_CONFIG2);			// REG_MODEM_CONFIG1 (=_codingRate)
  _spreadingFactor = (value >> 4) & 0x0F; 	// Storing 4 MSB from REG_MODEM_CONFIG2 (=_spreadingFactor)
  state = 1;

  if( isBW(_bandwidth) )		// Checking available values for:
  {								//		_bandwidth
	if( isCR(_codingRate) )		//		_codingRate
	{							//		_spreadingFactor
	   if( isSF(_spreadingFactor) )
	   {
		   state = 0;
	   }
	}
  }

  #if (SX1272_debug_mode > 1)
	  printf("## Parameters from configuration mode are:\n");
	  printf("\t Bandwidth: ");
	  printf("%X", _bandwidth);
	  printf("\n");
	  printf("\t Coding Rate: ");
	  printf("%X", _codingRate);
	  printf("\n");
	  printf("\t Spreading Factor: ");
	  printf("%X", _spreadingFactor);
	  printf(" ##\n");
	  printf("\n");
  #endif

  writeRegister(REG_OP_MODE, st0);	// Getting back to previous status
  delayMicroseconds(100);
  return state;
}

/*
 Function: Sets the bandwidth, coding rate and spreading factor of the LoRa modulation.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
 Parameters:
   mode: mode number to set the required BW, SF and CR of LoRa modem.
*/
int8_t SX1272::setMode(uint8_t mode)
{
  int8_t state = 2;
  byte st0;
  byte config1 = 0x00;
  byte config2 = 0x00;

