Ebiroll/qemu_esp32/examples/32_lora/components/lora/esp32LoRa.cpp
  #if (SX1272_debug_mode > 1)
	  printf("\n");
	  printf("Starting 'setMode'\n");
  #endif

  st0 = readRegister(REG_OP_MODE);		// Save the previous status

  if( _modem == FSK )
  {
	  setLORA();
  }
	writeRegister(REG_OP_MODE, LORA_STANDBY_MODE);	// LoRa standby mode

    switch (mode)
    {
        // mode 1 (better reach, medium time on air)
        case 1:     setCR(CR_5);        // CR = 4/5
                    setSF(SF_12);       // SF = 12
                    setBW(BW_125);      // BW = 125 KHz
                    break;
 
        // mode 2 (medium reach, less time on air)
        case 2:     setCR(CR_5);        // CR = 4/5
                    setSF(SF_12);       // SF = 12
                    setBW(BW_250);      // BW = 250 KHz
                    break;
 
        // mode 3 (worst reach, less time on air)
        case 3:     setCR(CR_5);        // CR = 4/5
                    setSF(SF_10);       // SF = 10
                    setBW(BW_125);      // BW = 125 KHz
                    break;
 
        // mode 4 (better reach, low time on air)
        case 4:     setCR(CR_5);        // CR = 4/5
                    setSF(SF_12);       // SF = 12
                    setBW(BW_500);      // BW = 500 KHz
                    break;
 
        // mode 5 (better reach, medium time on air)
        case 5:     setCR(CR_5);        // CR = 4/5
                    setSF(SF_10);       // SF = 10
                    setBW(BW_250);      // BW = 250 KHz
                    break;
 
        // mode 6 (better reach, worst time-on-air)
        case 6:     setCR(CR_5);        // CR = 4/5
                    setSF(SF_11);       // SF = 11
                    setBW(BW_500);      // BW = 500 KHz
                    break;
 
        // mode 7 (medium-high reach, medium-low time-on-air)
        case 7:     setCR(CR_5);        // CR = 4/5
                    setSF(SF_9);        // SF = 9
                    setBW(BW_250);      // BW = 250 KHz
                    break;
 
        // mode 8 (medium reach, medium time-on-air)
        case 8:     setCR(CR_5);        // CR = 4/5
                    setSF(SF_9);        // SF = 9
                    setBW(BW_500);      // BW = 500 KHz
                    break;
 
        // mode 9 (medium-low reach, medium-high time-on-air)
        case 9:     setCR(CR_5);        // CR = 4/5
                    setSF(SF_8);        // SF = 8
                    setBW(BW_500);      // BW = 500 KHz
                    break;
 
        // mode 10 (worst reach, less time_on_air)
        case 10:    setCR(CR_5);        // CR = 4/5
                    setSF(SF_7);        // SF = 7
                    setBW(BW_500);      // BW = 500 KHz
                    break;
 
        default:    state = -1; // The indicated mode doesn't exist
 
    };

	if( state == -1 )	// if state = -1, don't change its value
	{
		#if (SX1272_debug_mode > 1)
			printf("** The indicated mode doesn't exist, ");
			printf("please select from 1 to 10 **\n");
		#endif
	}
	else
	{
		state = 1;
		config1 = readRegister(REG_MODEM_CONFIG1);
        switch (mode)
        {   //      Different way to check for each mode:
            // (config1 >> 3) ---> take out bits 7-3 from REG_MODEM_CONFIG1 (=_bandwidth & _codingRate together)
            // (config2 >> 4) ---> take out bits 7-4 from REG_MODEM_CONFIG2 (=_spreadingFactor)
 
            // mode 1: BW = 125 KHz, CR = 4/5, SF = 12.
            case 1:  if( (config1 >> 3) == 0x01 )
                        {  config2 = readRegister(REG_MODEM_CONFIG2);
                        if( (config2 >> 4) == SF_12 )
                            {
                            state = 0;
                            }
                        }
                     break;
 
 
            // mode 2: BW = 250 KHz, CR = 4/5, SF = 12.
            case 2:  if( (config1 >> 3) == 0x09 )
                        {  config2 = readRegister(REG_MODEM_CONFIG2);
                        if( (config2 >> 4) == SF_12 )
                            {
                            state = 0;
                            }
                        }
                     break;
 
            // mode 3: BW = 125 KHz, CR = 4/5, SF = 10.
            case 3:  if( (config1 >> 3) == 0x01 )
                        {  config2 = readRegister(REG_MODEM_CONFIG2);
                        if( (config2 >> 4) == SF_10 )
                            {
                            state = 0;
                            }
                        }
                     break;
 
            // mode 4: BW = 500 KHz, CR = 4/5, SF = 12.
            case 4:  if( (config1 >> 3) == 0x11 )
                        {  config2 = readRegister(REG_MODEM_CONFIG2);
                        if( (config2 >> 4) == SF_12 )
                            {
                            state = 0;
                            }
                        }
                     break;
 
            // mode 5: BW = 250 KHz, CR = 4/5, SF = 10.
            case 5:  if( (config1 >> 3) == 0x09 )
                        {  config2 = readRegister(REG_MODEM_CONFIG2);
                        if( (config2 >> 4) == SF_10 )
                            {
                            state = 0;
                            }
                        }
                     break;
 
            // mode 6: BW = 500 KHz, CR = 4/5, SF = 11.
            case 6:  if( (config1 >> 3) == 0x11 )
                        {  config2 = readRegister(REG_MODEM_CONFIG2);
                        if( (config2 >> 4) == SF_11 )
                            {
                            state = 0;
                            }
                        }
                     break;
 
            // mode 7: BW = 250 KHz, CR = 4/5, SF = 9.
            case 7:  if( (config1 >> 3) == 0x09 )
                        {  config2 = readRegister(REG_MODEM_CONFIG2);
                        if( (config2 >> 4) == SF_9 )
                            {
                            state = 0;
                            }
                        }
                     break;
 
