Ebiroll/qemu_esp32/examples/32_lora/components/lora/esp32LoRa.cpp
            // mode 8: BW = 500 KHz, CR = 4/5, SF = 9.
            case 8:  if ((config1 >> 3) == 0x11)
                        {  config2 = readRegister(REG_MODEM_CONFIG2);
                        if( (config2 >> 4) == SF_9 )
                            {
                            state = 0;
                            }
                        }
                     break;
 
            // mode 9: BW = 500 KHz, CR = 4/5, SF = 8.
            case 9:  if( (config1 >> 3) == 0x11 )
                        {  config2 = readRegister(REG_MODEM_CONFIG2);
                        if( (config2 >> 4) == SF_8 )
                            {
                            state = 0;
                            }
                        }
                     break;
 
            // mode 10: BW = 500 KHz, CR = 4/5, SF = 7.
            case 10: if( (config1 >> 3) == 0x11 )
                        {  config2 = readRegister(REG_MODEM_CONFIG2);
                        if( (config2 >> 4) == SF_7 )
                            {
                            state = 0;
                            }
                        }
        }// end switch

  }
  #if (SX1272_debug_mode > 1)
  if( state == 0 )
  {
		  printf("## Mode ");
		  printf("%d", mode);
		  printf(" configured with success ##\n");
		  printf("\n");
  }
  else
  {
		  printf("** There has been an error while configuring mode ");
		  printf("%d", mode);
		  printf(". **\n");
		  printf("\n");
	 
  }
  #endif

  writeRegister(REG_OP_MODE, st0);	// Getting back to previous status
  delayMicroseconds(100);
  return state;
}

/*
 Function: Indicates if module is configured in implicit or explicit header mode.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t	SX1272::getHeader()
{
	int8_t state = 2;

	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'getHeader'\n");
	#endif

	// take out bit 2 from REG_MODEM_CONFIG1 indicates ImplicitHeaderModeOn
	if( bitRead(REG_MODEM_CONFIG1, 2) == 0 )
	{ // explicit header mode (ON)
		_header = HEADER_ON;
		state = 1;
	}
	else
	{ // implicit header mode (OFF)
		_header = HEADER_OFF;
		state = 1;
	}

	state = 0;

	if( _modem == FSK )
	{ // header is not available in FSK mode
		#if (SX1272_debug_mode > 1)
			printf("## Notice that FSK mode packets hasn't header ##\n");
			printf("\n");
		#endif
	}
	else
	{ // header in LoRa mode
		#if (SX1272_debug_mode > 1)
			printf("## Header is ");
			if( _header == HEADER_ON )
			{
				printf("in explicit header mode ##\n");
			}
			else
			{
				printf("in implicit header mode ##\n");
			}
			printf("\n");
		#endif
	}
	return state;
}

/*
 Function: Sets the module in explicit header mode (header is sent).
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
*/
int8_t	SX1272::setHeaderON()
{
  int8_t state = 2;
  byte config1;

  #if (SX1272_debug_mode > 1)
	  printf("\n");
	  printf("Starting 'setHeaderON'\n");
  #endif

  if( _modem == FSK )
  {
	  state = -1;		// header is not available in FSK mode
	  #if (SX1272_debug_mode > 1)
		  printf("## FSK mode packets hasn't header ##\n");
		  printf("\n");
	  #endif
  }
  else
  {
	config1 = readRegister(REG_MODEM_CONFIG1);	// Save config1 to modify only the header bit
	if( _spreadingFactor == 6 )
	{
		state = -1;		// Mandatory headerOFF with SF = 6
		#if (SX1272_debug_mode > 1)
			printf("## Mandatory implicit header mode with spreading factor = 6 ##\n");
		#endif
	}
	else
	{
		config1 = config1 & 0B11111011;			// clears bit 2 from config1 = headerON
		writeRegister(REG_MODEM_CONFIG1,config1);	// Update config1
	}
	if( _spreadingFactor != 6 )
	{ // checking headerON taking out bit 2 from REG_MODEM_CONFIG1
		config1 = readRegister(REG_MODEM_CONFIG1);
		if( bitRead(config1, 2) == HEADER_ON )
		{
			state = 0;
			_header = HEADER_ON;
			#if (SX1272_debug_mode > 1)
				printf("## Header has been activated ##\n");
				printf("\n");
			#endif
		}
		else
		{
			state = 1;
		}
	}
  }
  return state;
}

/*
 Function: Sets the module in implicit header mode (header is not sent).
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
*/
int8_t	SX1272::setHeaderOFF()
{
  uint8_t state = 2;
  byte config1;

  #if (SX1272_debug_mode > 1)
	  printf("\n");
	  printf("Starting 'setHeaderOFF'\n");
  #endif

  if( _modem == FSK )
  { // header is not available in FSK mode
	  state = -1;
	  #if (SX1272_debug_mode > 1)
		  printf("## Notice that FSK mode packets hasn't header ##\n");
		  printf("\n");
	  #endif
  }
  else
  {
	  config1 = readRegister(REG_MODEM_CONFIG1);	// Save config1 to modify only the header bit
	  config1 = config1 | 0B00000100;				// sets bit 2 from REG_MODEM_CONFIG1 = headerOFF
	  writeRegister(REG_MODEM_CONFIG1,config1);		// Update config1

	  config1 = readRegister(REG_MODEM_CONFIG1);
	  if( bitRead(config1, 2) == HEADER_OFF )
	  { // checking headerOFF taking out bit 2 from REG_MODEM_CONFIG1
			state = 0;
			_header = HEADER_OFF;

			#if (SX1272_debug_mode > 1)
			    printf("## Header has been desactivated ##\n");
			    printf("\n");
			#endif
	  }
	  else
	  {
		  state = 1;
		  #if (SX1272_debug_mode > 1)
			  printf("** Header hasn't been desactivated ##\n");
			  printf("\n");
		  #endif
	  }
  }
  return state;
}

/*
 Function: Indicates if module is configured with or without checking CRC.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t	SX1272::getCRC()
{
	int8_t state = 2;
	byte value;

