Ebiroll/qemu_esp32/examples/32_lora/components/lora/esp32LoRa.cpp
/*
 Function: Sets the indicated SF in the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
 Parameters:
   spr: spreading factor value to set in LoRa modem configuration.
*/
uint8_t	SX1272::setSF(uint8_t spr)
{
  byte st0;
  int8_t state = 2;
  byte config1;
  byte config2;

  #if (SX1272_debug_mode > 1)
	  printf("\n");
	  printf("Starting 'setSF'\n");
  #endif

  st0 = readRegister(REG_OP_MODE);	// Save the previous status

  if( _modem == FSK )
  {
	  #if (SX1272_debug_mode > 1)
		  printf("## Notice that FSK hasn't Spreading Factor parameter, ");
		  printf("so you are configuring it in LoRa mode ##\n");
	  #endif
	  state = setLORA();				// Setting LoRa mode
  }
  else
  { // LoRa mode
	writeRegister(REG_OP_MODE, LORA_STANDBY_MODE);	// LoRa standby mode
	config1 = (readRegister(REG_MODEM_CONFIG1));	// Save config1 to modify only the LowDataRateOptimize
	config2 = (readRegister(REG_MODEM_CONFIG2));	// Save config2 to modify SF value (bits 7-4)
	switch(spr)
	{
		case SF_6: 	config2 = config2 & 0B01101111;	// clears bits 7 & 4 from REG_MODEM_CONFIG2
					config2 = config2 | 0B01100000;	// sets bits 6 & 5 from REG_MODEM_CONFIG2
					setHeaderOFF();		// Mandatory headerOFF with SF = 6
					break;
		case SF_7: 	config2 = config2 & 0B01111111;	// clears bits 7 from REG_MODEM_CONFIG2
					config2 = config2 | 0B01110000;	// sets bits 6, 5 & 4
					break;
		case SF_8: 	config2 = config2 & 0B10001111;	// clears bits 6, 5 & 4 from REG_MODEM_CONFIG2
					config2 = config2 | 0B10000000;	// sets bit 7 from REG_MODEM_CONFIG2
					break;
		case SF_9: 	config2 = config2 & 0B10011111;	// clears bits 6, 5 & 4 from REG_MODEM_CONFIG2
					config2 = config2 | 0B10010000;	// sets bits 7 & 4 from REG_MODEM_CONFIG2
					break;
		case SF_10:	config2 = config2 & 0B10101111;	// clears bits 6 & 4 from REG_MODEM_CONFIG2
					config2 = config2 | 0B10100000;	// sets bits 7 & 5 from REG_MODEM_CONFIG2
					break;
		case SF_11:	config2 = config2 & 0B10111111;	// clears bit 6 from REG_MODEM_CONFIG2
					config2 = config2 | 0B10110000;	// sets bits 7, 5 & 4 from REG_MODEM_CONFIG2
					getBW();
					if( _bandwidth == BW_125 )
					{ // LowDataRateOptimize (Mandatory with SF_11 if BW_125)
						config1 = config1 | 0B00000001;
					}
					break;
		case SF_12: config2 = config2 & 0B11001111;	// clears bits 5 & 4 from REG_MODEM_CONFIG2
					config2 = config2 | 0B11000000;	// sets bits 7 & 6 from REG_MODEM_CONFIG2
					if( _bandwidth == BW_125 )
					{ // LowDataRateOptimize (Mandatory with SF_12 if BW_125)
						config1 = config1 | 0B00000001;
					}
					break;
	}

	// Check if it is neccesary to set special settings for SF=6
    if( spr == SF_6 )
    {       
        // Mandatory headerOFF with SF = 6 (Implicit mode)
        setHeaderOFF(); 
        
        // Set the bit field DetectionOptimize of 
        // register RegLoRaDetectOptimize to value "0b101".
        writeRegister(REG_DETECT_OPTIMIZE, 0x05);
        
        // Write 0x0C in the register RegDetectionThreshold.                        
        writeRegister(REG_DETECTION_THRESHOLD, 0x0C);
    }
    else
    {
        // LoRa detection Optimize: 0x03 --> SF7 to SF12
        writeRegister(REG_DETECT_OPTIMIZE, 0x03);
        
        // LoRa detection threshold: 0x0A --> SF7 to SF12                    
        writeRegister(REG_DETECTION_THRESHOLD, 0x0A);       
    }
 
    // sets bit 2-0 (AgcAutoOn and SymbTimout) for any SF value
    config2 = config2 | 0B00000111; 



	writeRegister(REG_MODEM_CONFIG1, config1);		// Update config1
	writeRegister(REG_MODEM_CONFIG2, config2);		// Update config2

	delayMicroseconds(100);

	config1 = (readRegister(REG_MODEM_CONFIG1));	// Save config1 to check update
	config2 = (readRegister(REG_MODEM_CONFIG2));	// Save config2 to check update
	// (config2 >> 4) ---> take out bits 7-4 from REG_MODEM_CONFIG2 (=_spreadingFactor)
	// bitRead(config1, 0) ---> take out bits 1 from config1 (=LowDataRateOptimize)
	switch(spr)
	{
		case SF_6:	if(		((config2 >> 4) == spr)
						&& 	(bitRead(config2, 2) == 1)
						&& 	(_header == HEADER_OFF))
					{
						state = 0;
					}
					break;
		case SF_7:	if(		((config2 >> 4) == 0x07)
						 && (bitRead(config2, 2) == 1))
					{
						state = 0;
					}
					break;
		case SF_8:	if(		((config2 >> 4) == 0x08)
						 && (bitRead(config2, 2) == 1))
					{
						state = 0;
					}
					break;
		case SF_9:	if(		((config2 >> 4) == 0x09)
						 && (bitRead(config2, 2) == 1))
					{
						state = 0;
					}
					break;
		case SF_10:	if(		((config2 >> 4) == 0x0A)
						 && (bitRead(config2, 2) == 1))
					{
						state = 0;
					}
					break;
		case SF_11:	if(		((config2 >> 4) == 0x0B)
						 && (bitRead(config2, 2) == 1)
						 && (bitRead(config1, 0) == 1))
					{
						state = 0;
					}
					break;
		case SF_12:	if(		((config2 >> 4) == 0x0C)
						 && (bitRead(config2, 2) == 1)
						 && (bitRead(config1, 0) == 1))
					{
						state = 0;
					}
					break;
		default:	state = 1;
	}
  }

  writeRegister(REG_OP_MODE, st0);	// Getting back to previous status
  delayMicroseconds(100);

  if( isSF(spr) )
  { // Checking available value for _spreadingFactor
		state = 0;
		_spreadingFactor = spr;
		#if (SX1272_debug_mode > 1)
		    printf("## Spreading factor ");
		    printf("%d", _spreadingFactor);
		    printf(" has been successfully set ##\n");
		    printf("\n");
		#endif
  }
  else
  {
	  if( state != 0 )
	  {
		  #if (SX1272_debug_mode > 1)
		      printf("** There has been an error while setting the spreading factor **");
		      printf("\n");
		  #endif
	  }
  }
  return state;
}

/*
 Function: Checks if BW is a valid value.
 Returns: Boolean that's 'true' if the BW value exists and
		  it's 'false' if the BW value does not exist.
 Parameters:
   band: bandwidth value to check.
*/
boolean	SX1272::isBW(uint16_t band)
{
  #if (SX1272_debug_mode > 1)
	  printf("\n");
	  printf("Starting 'isBW'\n");
  #endif

  // Checking available values for _bandwidth
  switch(band)
  {
	  case BW_125:
	  case BW_250:
	  case BW_500:	return true;
					break;

	  default:		return false;
  }
  #if (SX1272_debug_mode > 1)
	  printf("## Finished 'isBW' ##\n");
	  printf("\n");
  #endif
}

