Ebiroll/qemu_esp32/examples/32_lora/components/lora/esp32LoRa.cpp
/*
 Function: Sets the indicated CR in the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
 Parameters:
   cod: coding rate value to set in LoRa modem configuration.
*/
int8_t	SX1272::setCR(uint8_t cod)
{
  byte st0;
  int8_t state = 2;
  byte config1;

  #if (SX1272_debug_mode > 1)
	  printf("\n");
	  printf("Starting 'setCR'\n");
  #endif

  st0 = readRegister(REG_OP_MODE);		// Save the previous status

  if( _modem == FSK )
  {
	  #if (SX1272_debug_mode > 1)
		  printf("## Notice that FSK hasn't Coding Rate parameter, ");
		  printf("so you are configuring it in LoRa mode ##\n");
	  #endif
	  state = setLORA();
  }
  writeRegister(REG_OP_MODE, LORA_STANDBY_MODE);		// Set Standby mode to write in registers

  config1 = readRegister(REG_MODEM_CONFIG1);	// Save config1 to modify only the CR
  switch(cod)
  {
	 case CR_5: config1 = config1 & 0B11001111;	// clears bits 5 & 4 from REG_MODEM_CONFIG1
				config1 = config1 | 0B00001000;	// sets bit 3 from REG_MODEM_CONFIG1
				break;
	 case CR_6: config1 = config1 & 0B11010111;	// clears bits 5 & 3 from REG_MODEM_CONFIG1
				config1 = config1 | 0B00010000;	// sets bit 4 from REG_MODEM_CONFIG1
				break;
	 case CR_7: config1 = config1 & 0B11011111;	// clears bit 5 from REG_MODEM_CONFIG1
				config1 = config1 | 0B00011000;	// sets bits 4 & 3 from REG_MODEM_CONFIG1
			break;
	 case CR_8: config1 = config1 & 0B11100111;	// clears bits 4 & 3 from REG_MODEM_CONFIG1
				config1 = config1 | 0B00100000;	// sets bit 5 from REG_MODEM_CONFIG1
				break;
  }
  writeRegister(REG_MODEM_CONFIG1, config1);		// Update config1

  delayMicroseconds(100);

  config1 = readRegister(REG_MODEM_CONFIG1);
  // ((config1 >> 3) & B0000111) ---> take out bits 5-3 from REG_MODEM_CONFIG1 (=_codingRate)
  switch(cod)
  {
	 case CR_5: if( ((config1 >> 3) & 0B0000111) == 0x01 )
				{
					state = 0;
				}
			break;
	 case CR_6: if( ((config1 >> 3) & 0B0000111) == 0x02 )
				{
					state = 0;
				}
				break;
	 case CR_7: if( ((config1 >> 3) & 0B0000111) == 0x03 )
				{
					state = 0;
				}
				break;
	 case CR_8: if( ((config1 >> 3) & 0B0000111) == 0x04 )
				{
					state = 0;
				}
				break;
  }

  if( isCR(cod) )
  {
	  _codingRate = cod;
	  #if (SX1272_debug_mode > 1)
		  printf("## Coding Rate ");
		  printf("%X", cod);
		  printf(" has been successfully set ##\n");
		  printf("\n");
	  #endif
  }
  else
  {
	  state = 1;
	  #if (SX1272_debug_mode > 1)
		  printf("** There has been an error while configuring Coding Rate parameter **\n");
		  printf("\n");
	  #endif
  }
  writeRegister(REG_OP_MODE,st0);	// Getting back to previous status
  delayMicroseconds(100);
  return state;
}

/*
 Function: Checks if channel is a valid value.
 Returns: Boolean that's 'true' if the CR value exists and
		  it's 'false' if the CR value does not exist.
 Parameters:
   ch: frequency channel value to check.
*/
boolean	SX1272::isChannel(uint32_t ch)
{
  #if (SX1272_debug_mode > 1)
	  printf("\n");
	  printf("Starting 'isChannel'\n");
  #endif

  // Checking available values for _channel
  switch(ch)
  {
	  case CH_10_868:
	  case CH_11_868:
	  case CH_12_868:
	  case CH_13_868:
	  case CH_14_868:
	  case CH_15_868:
	  case CH_16_868:
	  case CH_17_868:
	  case CH_00_900:
	  case CH_01_900:
	  case CH_02_900:
	  case CH_03_900:
	  case CH_04_900:
	  case CH_05_900:
	  case CH_06_900:
	  case CH_07_900:
	  case CH_08_900:
	  case CH_09_900:
	  case CH_10_900:
	  case CH_11_900:	return true;
						break;

	  default:			return false;
  }
  #if (SX1272_debug_mode > 1)
	  printf("## Finished 'isChannel' ##\n");
	  printf("\n");
  #endif
}

/*
 Function: Indicates the frequency channel within the module is configured.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::getChannel()
{
  uint8_t state = 2;
  uint32_t ch;
  uint8_t freq3;
  uint8_t freq2;
  uint8_t freq1;

  #if (SX1272_debug_mode > 1)
	  printf("\n");
	  printf("Starting 'getChannel'\n");
  #endif

  freq3 = readRegister(REG_FRF_MSB);	// frequency channel MSB
  freq2 = readRegister(REG_FRF_MID);	// frequency channel MID
  freq1 = readRegister(REG_FRF_LSB);	// frequency channel LSB
  ch = ((uint32_t)freq3 << 16) + ((uint32_t)freq2 << 8) + (uint32_t)freq1;
  _channel = ch;						// frequency channel

  if( (_channel == ch) && isChannel(_channel) )
  {
	  state = 0;
	  #if (SX1272_debug_mode > 1)
		  printf("## Frequency channel is ");
		  printf("%X", _channel);
		  printf(" ##\n");
		  printf("\n");
	  #endif
  }
  else
  {
	  state = 1;
  }
  return state;
}

/*
 Function: Sets the indicated channel in the module.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
 Parameters:
   ch: frequency channel value to set in configuration.
*/
int8_t SX1272::setChannel(uint32_t ch)
{
  byte st0;
  int8_t state = 2;
  unsigned int freq3;
  unsigned int freq2;
  uint8_t freq1;
  uint32_t freq;

  #if (SX1272_debug_mode > 1)
	  printf("\n");
	  printf("Starting 'setChannel'\n");
  #endif

  st0 = readRegister(REG_OP_MODE);	// Save the previous status
  if( _modem == LORA )
  {
	  // LoRa Stdby mode in order to write in registers
	  writeRegister(REG_OP_MODE, LORA_STANDBY_MODE);
  }
  else
  {
	  // FSK Stdby mode in order to write in registers
	  writeRegister(REG_OP_MODE, FSK_STANDBY_MODE);
  }

  freq3 = ((ch >> 16) & 0x0FF);		// frequency channel MSB
  freq2 = ((ch >> 8) & 0x0FF);		// frequency channel MIB
  freq1 = (ch & 0xFF);				// frequency channel LSB

  writeRegister(REG_FRF_MSB, freq3);
  writeRegister(REG_FRF_MID, freq2);
  writeRegister(REG_FRF_LSB, freq1);

