Ebiroll/qemu_esp32/examples/32_lora/components/lora/esp32LoRa.cpp
	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'setNodeAddress'\n");
	#endif

	if( addr > 255 )
	{
		state = -1;
		#if (SX1272_debug_mode > 1)
			printf("** Node address must be less than 255 **\n");
			printf("\n");
		#endif
	}
	else
	{
		// Saving node address
		_nodeAddress = addr;
		st0 = readRegister(REG_OP_MODE);	  // Save the previous status

		if( _modem == LORA )
		{ // Allowing access to FSK registers while in LoRa standby mode
			writeRegister(REG_OP_MODE, LORA_STANDBY_FSK_REGS_MODE);
		}
		else
		{ //Set FSK Standby mode to write in registers
			writeRegister(REG_OP_MODE, FSK_STANDBY_MODE);
		}

		// Storing node and broadcast address
		writeRegister(REG_NODE_ADRS, addr);
		writeRegister(REG_BROADCAST_ADRS, BROADCAST_0);

		value = readRegister(REG_NODE_ADRS);
		writeRegister(REG_OP_MODE, st0);		// Getting back to previous status

		if( value == _nodeAddress )
		{
			state = 0;
			#if (SX1272_debug_mode > 1)
				printf("## Node address ");
				printf("%d", addr);
				printf(" has been successfully set ##\n");
				printf("\n");
			#endif
		}
		else
		{
			state = 1;
			#if (SX1272_debug_mode > 1)
				printf("** There has been an error while setting address ##\n");
				printf("\n");
			#endif
		}
	}
	return state;
}

/*
 Function: Gets the SNR value in LoRa mode.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
*/
int8_t SX1272::getSNR()
{	// getSNR exists only in LoRa mode
  int8_t state = 2;
  byte value;

  #if (SX1272_debug_mode > 1)
	  printf("\n");
	  printf("Starting 'getSNR'\n");
  #endif

  if( _modem == LORA )
  { // LoRa mode
	  state = 1;
	  value = readRegister(REG_PKT_SNR_VALUE);
	  if( value & 0x80 ) // The SNR sign bit is 1
	  {
		  // Invert and divide by 4
		  value = ( ( ~value + 1 ) & 0xFF ) >> 2;
          _SNR = -value;
      }
      else
      {
		  // Divide by 4
		  _SNR = ( value & 0xFF ) >> 2;
	  }
	  state = 0;
	  #if (SX1272_debug_mode > 0)
		  printf("## SNR value is ");
		  printf("%d", _SNR);
		  printf(" ##\n");
		  printf("\n");
	  #endif
  }
  else
  { // forbidden command if FSK mode
	state = -1;
	#if (SX1272_debug_mode > 0)
		printf("** SNR does not exist in FSK mode **\n");
		printf("\n");
	#endif
  }
  return state;
}

/*
 Function: Gets the current value of RSSI.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::getRSSI()
{
  uint8_t state = 2;
  int rssi_mean = 0;
  int total = 5;

	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'getRSSI'\n");
	#endif

  if( _modem == LORA )
    { 
        /// LoRa mode
        // get mean value of RSSI
        for(int i = 0; i < total; i++)
        {
            _RSSI = -OFFSET_RSSI + readRegister(REG_RSSI_VALUE_LORA);
            rssi_mean += _RSSI;         
        }
 
        rssi_mean = rssi_mean / total;  
        _RSSI = rssi_mean;
        
        state = 0;
	  #if (SX1272_debug_mode > 0)
		  printf("## RSSI value is ");
		  printf("%d", _RSSI);
		  printf(" ##\n");
		  printf("\n");
	  #endif
	  
  }
  else
  { 
  		/// FSK mode
        // get mean value of RSSI
        for(int i = 0; i < total; i++)
        {
            _RSSI = (readRegister(REG_RSSI_VALUE_FSK) >> 1);
            rssi_mean += _RSSI;
        }
        rssi_mean = rssi_mean / total;  
        _RSSI = rssi_mean;
        
        state = 0;

	  #if (SX1272_debug_mode > 0)
		  printf("## RSSI value is ");
		  printf("%d", _RSSI);
		  printf(" ##\n");
		  printf("\n");
	  #endif 
  }
  return state;
}

/*
 Function: Gets the RSSI of the last packet received in LoRa mode.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden command for this protocol
*/
int16_t SX1272::getRSSIpacket()
{	// RSSIpacket only exists in LoRa
  int8_t state = 2;

  #if (SX1272_debug_mode > 1)
	  printf("\n");
	  printf("Starting 'getRSSIpacket'\n");
  #endif

  state = 1;
  if( _modem == LORA )
  { // LoRa mode
	  state = getSNR();
	  if( state == 0 )
	  {
		  if( _SNR < 0 )
		  {
			  _RSSIpacket = -NOISE_ABSOLUTE_ZERO + 10.0 * SignalBwLog[_bandwidth] + NOISE_FIGURE + ( double )_SNR;
			  state = 0;
		  }
		  else
		  {
			  _RSSIpacket = readRegister(REG_PKT_RSSI_VALUE);
			  _RSSIpacket = -OFFSET_RSSI + ( double )_RSSIpacket;
			  state = 0;
		  }
	  #if (SX1272_debug_mode > 0)
		  printf("## RSSI packet value is ");
		  printf("%d", _RSSIpacket);
  		  printf(" ##\n");
		  printf("\n");
	  #endif
	  }
  }
  else
  { // RSSI packet doesn't exist in FSK mode
	state = -1;
	#if (SX1272_debug_mode > 0)
		printf("** RSSI packet does not exist in FSK mode **\n");
		printf("\n");
	#endif
  }
  return state;
}

/*
 Function: It sets the maximum number of retries.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 -->
*/
uint8_t SX1272::setRetries(uint8_t ret)
{
	uint8_t state = 2;

	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'setRetries'\n");
	#endif

	state = 1;
	if( ret > MAX_RETRIES )
	{
		state = -1;
		#if (SX1272_debug_mode > 1)
			printf("** Retries value can't be greater than ");
			printf("%d", MAX_RETRIES);
			printf(" **\n");
			printf("\n");
		#endif
	}
	else
	{
		_maxRetries = ret;
		state = 0;
		#if (SX1272_debug_mode > 1)
			printf("## Maximum retries value = ");
			printf("%d", _maxRetries);
			printf(" ##\n");
			printf("\n");
		#endif
	}
	return state;
}

