Ebiroll/qemu_esp32/examples/32_lora/components/lora/esp32LoRa.cpp
	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'setACK'\n");
	#endif

	// delayMicroseconds(1000);

	clearFlags();	// Initializing flags

	if( _modem == LORA )
	{ // LoRa mode
		writeRegister(REG_OP_MODE, LORA_STANDBY_MODE);	// Stdby LoRa mode to write in FIFO
	}
	else
	{ // FSK mode
		writeRegister(REG_OP_MODE, FSK_STANDBY_MODE);	// Stdby FSK mode to write in FIFO
	}

	// Setting ACK length in order to send it
	state = setPacketLength(ACK_LENGTH);
	if( state == 0 )
	{
		// Setting ACK
		ACK.dst = packet_received.src; // ACK destination is packet source
		ACK.src = packet_received.dst; // ACK source is packet destination
		ACK.packnum = packet_received.packnum; // packet number that has been correctly received
		ACK.length = 0;		  // length = 0 to show that's an ACK
		ACK.data[0] = _reception;	// CRC of the received packet

		// Setting address pointer in FIFO data buffer
		writeRegister(REG_FIFO_ADDR_PTR, 0x80);

		state = 1;

		// Writing ACK to send in FIFO
		writeRegister(REG_FIFO, ACK.dst); 		// Writing the destination in FIFO
		writeRegister(REG_FIFO, ACK.src);		// Writing the source in FIFO
		writeRegister(REG_FIFO, ACK.packnum);	// Writing the packet number in FIFO
		writeRegister(REG_FIFO, ACK.length); 	// Writing the packet length in FIFO
		writeRegister(REG_FIFO, ACK.data[0]);	// Writing the ACK in FIFO

		#if (SX1272_debug_mode > 0)
			printf("## ACK set and written in FIFO ##\n");
			// Print the complete ACK if debug_mode
			printf("## ACK to send:\n");
			printf("Destination: ");
			printf("%d\n", ACK.dst);			 	// Printing destination
			printf("Source: ");
			printf("%d\n", ACK.src);			 	// Printing source
			printf("ACK number: ");
			printf("%d\n", ACK.packnum);			// Printing ACK number
			printf("ACK length: ");
			printf("%d\n", ACK.length);				// Printing ACK length
			printf("ACK payload: ");
			printf("%d\n", ACK.data[0]);			// Printing ACK payload
			printf(" ##\n");
			printf("\n");
		#endif

		state = 0;
		_reception = CORRECT_PACKET;		// Updating value to next packet

		delayMicroseconds(500);
	}
	return state;
}

/*
 Function: Configures the module to receive information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::receive()
{
	  uint8_t state = 2;

	  #if (SX1272_debug_mode > 1)
		  printf("\n");
		  printf("Starting 'receive'\n");
	  #endif

	  // Initializing packet_received struct
	  memset( &packet_received, 0x00, sizeof(packet_received) );

		// Setting Testmode
   		 writeRegister(0x31,0x43);
    	// Set LowPnTxPllOff 
    	writeRegister(REG_PA_RAMP, 0x09);

	  writeRegister(REG_LNA, 0x23);			// Important in reception
	  writeRegister(REG_FIFO_ADDR_PTR, 0x00);  // Setting address pointer in FIFO data buffer
  	  // change RegSymbTimeoutLsb 
      writeRegister(REG_SYMB_TIMEOUT_LSB, 0xFF);
  	  writeRegister(REG_FIFO_RX_BYTE_ADDR, 0x00); // Setting current value of reception buffer pointer
	 // clearFlags();						// Initializing flags
	  state = 1;
    
    //printf("_modem: %d\n", _modem);
	  if( _modem == LORA )
	  { // LoRa mode
	  	  state = setPacketLength(MAX_LENGTH);	// With MAX_LENGTH gets all packets with length < MAX_LENGTH
		  writeRegister(REG_OP_MODE, LORA_RX_MODE);  	  // LORA mode - Rx
		  #if (SX1272_debug_mode > 1)
		  	  printf("## Receiving LoRa mode activated with success ##\n");
		  	  printf("\n");
		  #endif
	  }
	  else
	  { // FSK mode
		  state = setPacketLength();
		  writeRegister(REG_OP_MODE, FSK_RX_MODE);  // FSK mode - Rx
		  #if (SX1272_debug_mode > 1)
		  	  printf("## Receiving FSK mode activated with success ##\n");
		  	  printf("\n");
		  #endif
	  }
	  return state;
}

/*
 Function: Configures the module to receive information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::receivePacketMAXTimeout()
{
	return receivePacketTimeout(MAX_TIMEOUT);
}

/*
 Function: Configures the module to receive information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::receivePacketTimeout()
{
	setTimeout();
	return receivePacketTimeout(_sendTime);
}

/*
 Function: Configures the module to receive information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::receivePacketTimeout(uint16_t wait)
{
	uint8_t state = 2;
	uint8_t state_f = 2;

	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'receivePacketTimeout'\n");
	#endif

	state = receive();
	if( state == 0 )
	{
		if( availableData(wait) )
		{
			// If packet received, getPacket
			state_f = getPacket();
		}
		else
		{
			state_f = 1;
		}
	}
	else
	{
		state_f = state;
	}
	return state_f;
}

/*
 Function: Configures the module to receive information and send an ACK.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::receivePacketMAXTimeoutACK()
{
	return receivePacketTimeoutACK(MAX_TIMEOUT);
}

/*
 Function: Configures the module to receive information and send an ACK.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::receivePacketTimeoutACK()
{
	setTimeout();
	return receivePacketTimeoutACK(_sendTime);
}

