Ebiroll/qemu_esp32/examples/32_lora/components/lora/esp32LoRa.cpp
/*
 Function: Configures the module to receive information and send an ACK.
 Returns: Integer that determines if there has been any error
   state = 4  --> The command has been executed but the packet received is incorrect
   state = 3  --> The command has been executed but there is no packet received
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::receivePacketTimeoutACK(uint16_t wait)
{
	uint8_t state = 2;
	uint8_t state_f = 2;


	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'receivePacketTimeoutACK'\n");
	#endif

	state = receive();
	if( state == 0 )
	{
		if( availableData(wait) )
		{
			state = getPacket();
		}
		else
		{
			state = 1;
			state_f = 3;  // There is no packet received
		}
	}
	else
	{
		state = 1;
		state_f = 1; // There has been an error with the 'receive' function
	}
	if( (state == 0) || (state == 3) )
	{
		if( _reception == INCORRECT_PACKET )
		{
			state_f = 4;  // The packet has been incorrectly received
		}
		else
		{
			state_f = 1;  // The packet has been correctly received
		}
		state = setACK();
		if( state == 0 )
		{
			state = sendWithTimeout();
			if( state == 0 )
			{
			state_f = 0;
			#if (SX1272_debug_mode > 1)
				printf("This last packet was an ACK, so ...\n");
				printf("ACK successfully sent\n");
				printf("\n");
			#endif
			}
			else
			{
				state_f = 1; // There has been an error with the 'sendWithTimeout' function
			}
		}
		else
		{
			state_f = 1; // There has been an error with the 'setACK' function
		}
	}
	else
	{
		state_f = 1;
	}
	return state_f;
}

/*
 Function: Configures the module to receive all the information on air, before MAX_TIMEOUT expires.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t	SX1272::receiveAll()
{
	return receiveAll(MAX_TIMEOUT);
}

/*
 Function: Configures the module to receive all the information on air.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::receiveAll(uint16_t wait)
{
	  uint8_t state = 2;
	  byte config1;

	  #if (SX1272_debug_mode > 1)
		  printf("\n");
		  printf("Starting 'receiveAll'\n");
	  #endif

	  if( _modem == FSK )
	  { // FSK mode
		 writeRegister(REG_OP_MODE, FSK_STANDBY_MODE);		// Setting standby FSK mode
		 config1 = readRegister(REG_PACKET_CONFIG1);
		 config1 = config1 & 0B11111001;			// clears bits 2-1 from REG_PACKET_CONFIG1
		 writeRegister(REG_PACKET_CONFIG1, config1);		// AddressFiltering = None
	  }
	  #if (SX1272_debug_mode > 1)
		  printf("## Address filtering desactivated ##\n");
		  printf("\n");
	  #endif
	  state = receive();	// Setting Rx mode
	  if( state == 0 )
	  {
		  state = getPacket(wait);	// Getting all packets received in wait
	  }
	  return state;
}

/*
 Function: If a packet is received, checks its destination.
 Returns: Boolean that's 'true' if the packet is for the module and
		  it's 'false' if the packet is not for the module.
*/
boolean	SX1272::availableData()
{
	return availableData(MAX_TIMEOUT);
}

/*
 Function: If a packet is received, checks its destination.
 Returns: Boolean that's 'true' if the packet is for the module and
		  it's 'false' if the packet is not for the module.
 Parameters:
   wait: time to wait while there is no a valid header received.
*/
boolean	SX1272::availableData(uint16_t wait)
{
	byte value;
	byte header = 0;
	boolean forme = false;
	boolean	_hreceived = false;
	unsigned long previous;


	#if (SX1272_debug_mode > 0)
		printf("\n");
		printf("Starting 'availableData'\n");
	#endif

	previous = millis();
	if( _modem == LORA )
	{ // LoRa mode
		value = readRegister(REG_IRQ_FLAGS);
		// Wait to ValidHeader interrupt
		while( (bitRead(value, 4) == 0) && (millis() - previous < (unsigned long)wait) )
		{
			value = readRegister(REG_IRQ_FLAGS);
			// Condition to avoid an overflow (DO NOT REMOVE)
			if( millis() < previous )
			{
				previous = millis();
			}
		} // end while (millis)
		if( bitRead(value, 4) == 1 )
		{ // header received
			#if (SX1272_debug_mode > 0)
				printf("## Valid Header received in LoRa mode ##\n");
			#endif
			_hreceived = true;
			while( (header == 0) && (millis() - previous < (unsigned long)wait) )
			{ // Waiting to read first payload bytes from packet
				header = readRegister(REG_FIFO_RX_BYTE_ADDR);
                 delay(1000);
				// Condition to avoid an overflow (DO NOT REMOVE)
				if( millis() < previous )
				{
					previous = millis();
				}
			}
			if( header != 0 )
			{ // Reading first byte of the received packet
				_destination = readRegister(REG_FIFO);
			}
		}
		else
		{
			forme = false;
			_hreceived = false;
			#if (SX1272_debug_mode > 0)
				printf("** The timeout has expired **\n");
				printf("\n");
			#endif
		}
	}
	else
	{ // FSK mode
		value = readRegister(REG_IRQ_FLAGS2);
		// Wait to Payload Ready interrupt
		while( (bitRead(value, 2) == 0) && (millis() - previous < wait) )
		{
			value = readRegister(REG_IRQ_FLAGS2);
			// Condition to avoid an overflow (DO NOT REMOVE)
			if( millis() < previous )
			{
				previous = millis();
			}
		}// end while (millis)
		if( bitRead(value, 2) == 1 )	// something received
		{
			_hreceived = true;
			#if (SX1272_debug_mode > 0)
				printf("## Valid Preamble detected in FSK mode ##\n");
			#endif
			// Reading first byte of the received packet
			_destination = readRegister(REG_FIFO);
		}
		else
		{
			forme = false;
			_hreceived = false;
			#if (SX1272_debug_mode > 0)
				printf("** The timeout has expired **\n");
				printf("\n");
			#endif
		}
	}
// We use _hreceived because we need to ensure that _destination value is correctly
// updated and is not the _destination value from the previously packet
	if( _hreceived )
	{ // Checking destination
		#if (SX1272_debug_mode > 0)
			printf("## Checking destination ##\n");
		#endif
		if( (_destination == _nodeAddress) || (_destination == BROADCAST_0) )
		{ // LoRa or FSK mode
			forme = true;
			#if (SX1272_debug_mode > 0)
				printf("## Packet received is for me ##\n");
			#endif
		}
		else
		{
			forme = false;
			#if (SX1272_debug_mode > 0)
				printf("## Packet received is not for me ##\n");
				printf("\n");
			#endif
			if( _modem == LORA )	// STANDBY PARA MINIMIZAR EL CONSUMO
			{ // LoRa mode
				writeRegister(REG_OP_MODE, LORA_STANDBY_MODE);	// Setting standby LoRa mode
			}
			else
			{ //  FSK mode
				writeRegister(REG_OP_MODE, FSK_STANDBY_MODE);	// Setting standby FSK mode
			}
		}
	}
//----else
//	{
//	}
	return forme;
}

