Ebiroll/qemu_esp32/examples/32_lora/components/lora/esp32LoRa.cpp
/*
 Function: It gets and stores a packet if it is received before MAX_TIMEOUT expires.
 Returns:  Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::getPacketMAXTimeout()
{
	return getPacket(MAX_TIMEOUT);
}

/*
 Function: It gets and stores a packet if it is received.
 Returns:  Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
int8_t SX1272::getPacket()
{
	return getPacket(MAX_TIMEOUT);
}

/*
 Function: It gets and stores a packet if it is received before ending 'wait' time.
 Returns:  Integer that determines if there has been any error
   state = 3  --> The command has been executed but packet has been incorrectly received
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
   state = -1 --> Forbidden parameter value for this function
 Parameters:
   wait: time to wait while there is no a valid header received.
*/
int8_t SX1272::getPacket(uint16_t wait)
{
	uint8_t state = 2;
	byte value = 0x00;
	unsigned long previous;
	boolean p_received = false;

	#if (SX1272_debug_mode > 0)
		printf("\n");
		printf("Starting 'getPacket'\n");
	#endif

	previous = millis();
	if( _modem == LORA )
	{ // LoRa mode
		value = readRegister(REG_IRQ_FLAGS);
		// Wait until the packet is received (RxDone flag) or the timeout expires
		while( (bitRead(value, 6) == 0) && (millis() - previous < (unsigned long)wait) )
		{
			value = readRegister(REG_IRQ_FLAGS);
			// Condition to avoid an overflow (DO NOT REMOVE)
			if( millis() < previous )
			{
				previous = millis();
			}
		} // end while (millis)

		if( (bitRead(value, 6) == 1) && (bitRead(value, 5) == 0) )
		{ // packet received & CRC correct
			p_received = true;	// packet correctly received
			_reception = CORRECT_PACKET;
			#if (SX1272_debug_mode > 0)
				printf("## Packet correctly received in LoRa mode ##\n");
			#endif
		}
		else
		{
			if( bitRead(value, 5) != 0 )
			{ // CRC incorrect
				_reception = INCORRECT_PACKET;
				state = 3;
				#if (SX1272_debug_mode > 0)
					printf("** The CRC is incorrect **\n");
					printf("\n");
				#endif
			}
		}
		//writeRegister(REG_OP_MODE, LORA_STANDBY_MODE);	// Setting standby LoRa mode
	}
	else
	{ // FSK mode
		value = readRegister(REG_IRQ_FLAGS2);
		while( (bitRead(value, 2) == 0) && (millis() - previous < wait) )
		{
			value = readRegister(REG_IRQ_FLAGS2);
			// Condition to avoid an overflow (DO NOT REMOVE)
			if( millis() < previous )
			{
				previous = millis();
			}
		} // end while (millis)
		if( bitRead(value, 2) == 1 )
		{ // packet received
 			if( bitRead(value, 1) == 1 )
			{ // CRC correct
				_reception = CORRECT_PACKET;
				p_received = true;
				#if (SX1272_debug_mode > 0)
					printf("## Packet correctly received in FSK mode ##\n");
				#endif
			}
			else
			{ // CRC incorrect
				_reception = INCORRECT_PACKET;
				state = 3;
				p_received = false;
				#if (SX1272_debug_mode > 0)
					printf("## Packet incorrectly received in FSK mode ##\n");
				#endif
			}
		}
		else
		{
			#if (SX1272_debug_mode > 0)
				printf("** The timeout has expired **\n");
				printf("\n");
			#endif
		}
		writeRegister(REG_OP_MODE, FSK_STANDBY_MODE);	// Setting standby FSK mode
	}
	if( p_received )
	{
		// Store the packet
		if( _modem == LORA )
		{
			writeRegister(REG_FIFO_ADDR_PTR, 0x00);  		// Setting address pointer in FIFO data buffer
			packet_received.dst = readRegister(REG_FIFO);	// Storing first byte of the received packet
		}
		else
		{
			value = readRegister(REG_PACKET_CONFIG1);
			if( (bitRead(value, 2) == 0) && (bitRead(value, 1) == 0) )
			{
				packet_received.dst = readRegister(REG_FIFO); // Storing first byte of the received packet
			}
			else
			{
				packet_received.dst = _destination;			// Storing first byte of the received packet
			}
		}
		packet_received.src = readRegister(REG_FIFO);		// Reading second byte of the received packet
		packet_received.packnum = readRegister(REG_FIFO);	// Reading third byte of the received packet
		packet_received.length = readRegister(REG_FIFO);	// Reading fourth byte of the received packet
		if( _modem == LORA )
		{
			_payloadlength = packet_received.length - OFFSET_PAYLOADLENGTH;
		}
		if( packet_received.length > (MAX_LENGTH + 1) )
		{
			#if (SX1272_debug_mode > 0)
				printf("Corrupted packet, length must be less than 256\n");
			#endif
		}
		else
		{
			for(unsigned int i = 0; i < _payloadlength; i++)
			{
				packet_received.data[i] = readRegister(REG_FIFO); // Storing payload
			}
			packet_received.retry = readRegister(REG_FIFO);
			// Print the packet if debug_mode
			#if (SX1272_debug_mode > 0)
				printf("## Packet received:\n");
				printf("Destination: ");
				printf("%d\n", packet_received.dst);			 	// Printing destination
				printf("Source: ");
				printf("%d\n", packet_received.src);			 	// Printing source
				printf("Packet number: ");
				printf("%d\n", packet_received.packnum);			// Printing packet number
				printf("Packet length: ");
				printf("%d\n", packet_received.length);			// Printing packet length
				printf("Data: ");
				for(unsigned int i = 0; i < _payloadlength; i++)
				{
					printf("%c", packet_received.data[i]);		// Printing payload
				}
				printf("\n");
				printf("Retry number: ");
				printf("%d\n", packet_received.retry);			// Printing number retry
				printf(" ##\n");
				printf("\n");
			#endif
			state = 0;
		}
	}
	else
	{
		state = 1;
		if( (_reception == INCORRECT_PACKET) && (_retries < _maxRetries) )
		{
			_retries++;
			#if (SX1272_debug_mode > 0)
				printf("## Retrying to send the last packet ##\n");
				printf("\n");
			#endif
		}
	}
	if( _modem == LORA )
	{
		writeRegister(REG_FIFO_ADDR_PTR, 0x00);  // Setting address pointer in FIFO data buffer
	}
	clearFlags();	// Initializing flags
	if( wait > MAX_WAIT )
	{
		state = -1;
		#if (SX1272_debug_mode > 0)
			printf("** The timeout must be smaller than 12.5 seconds **\n");
			printf("\n");
		#endif
	}

	return state;
}

