Ebiroll/qemu_esp32/examples/32_lora/components/lora/esp32LoRa.cpp
/*
 Function: It sets the packet destination.
 Returns:  Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
 Parameters:
   dest: destination value of the packet sent.
*/
int8_t SX1272::setDestination(uint8_t dest)
{
	int8_t state = 2;

	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'setDestination'\n");
	#endif

	state = 1;
	_destination = dest; // Storing destination in a global variable
	packet_sent.dst = dest;	 // Setting destination in packet structure
	packet_sent.src = _nodeAddress; // Setting source in packet structure
	packet_sent.packnum = _packetNumber;	// Setting packet number in packet structure
	_packetNumber++;
	state = 0;

	#if (SX1272_debug_mode > 1)
		printf("## Destination ");
		printf("%X", _destination);
		printf(" successfully set ##\n");
		printf("## Source ");
		printf("%d", packet_sent.src);
		printf(" successfully set ##\n");
		printf("## Packet number ");
		printf("%d", packet_sent.packnum);
		printf(" successfully set ##\n");
		printf("\n");
	#endif
	return state;
}

/*
 Function: It sets the timeout according to the configured mode.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::setTimeout()
{
	uint8_t state = 2;
	uint16_t delay;

	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'setTimeout'\n");
	#endif

	state = 1;
	if( _modem == LORA )
	{
		switch(_spreadingFactor)
		{	// Choosing Spreading Factor
			case SF_6:	switch(_bandwidth)
						{	// Choosing bandwidth
							case BW_125:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 335;
														break;
												case CR_6: _sendTime = 352;
														break;
												case CR_7: _sendTime = 368;
														break;
												case CR_8: _sendTime = 386;
														break;
											}
											break;
							case BW_250:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 287;
														break;
												case CR_6: _sendTime = 296;
														break;
												case CR_7: _sendTime = 305;
														break;
												case CR_8: _sendTime = 312;
														break;
											}
											break;
							case BW_500:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 242;
														break;
												case CR_6: _sendTime = 267;
														break;
												case CR_7: _sendTime = 272;
														break;
												case CR_8: _sendTime = 276;
														break;
											}
											break;
						}
						break;

			case SF_7:	switch(_bandwidth)
						{	// Choosing bandwidth
							case BW_125:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 408;
														break;
												case CR_6: _sendTime = 438;
														break;
												case CR_7: _sendTime = 468;
														break;
												case CR_8: _sendTime = 497;
														break;
											}
											break;
							case BW_250:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 325;
														break;
												case CR_6: _sendTime = 339;
														break;
												case CR_7: _sendTime = 355;
														break;
												case CR_8: _sendTime = 368;
														break;
											}
											break;
							case BW_500:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 282;
														break;
												case CR_6: _sendTime = 290;
														break;
												case CR_7: _sendTime = 296;
														break;
												case CR_8: _sendTime = 305;
														break;
											}
											break;
						}
						break;

			case SF_8:	switch(_bandwidth)
						{	// Choosing bandwidth
							case BW_125:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 537;
														break;
												case CR_6: _sendTime = 588;
														break;
												case CR_7: _sendTime = 640;
														break;
												case CR_8: _sendTime = 691;
														break;
											}
											break;
							case BW_250:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 388;
														break;
												case CR_6: _sendTime = 415;
														break;
												case CR_7: _sendTime = 440;
														break;
												case CR_8: _sendTime = 466;
														break;
											}
											break;
							case BW_500:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 315;
														break;
												case CR_6: _sendTime = 326;
														break;
												case CR_7: _sendTime = 340;
														break;
												case CR_8: _sendTime = 352;
														break;
											}
											break;
						}
						break;

			case SF_9:	switch(_bandwidth)
						{	// Choosing bandwidth
							case BW_125:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 774;
														break;
												case CR_6: _sendTime = 864;
														break;
												case CR_7: _sendTime = 954;
														break;
												case CR_8: _sendTime = 1044;
														break;
											}
											break;
							case BW_250:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 506;
														break;
												case CR_6: _sendTime = 552;
														break;
												case CR_7: _sendTime = 596;
														break;
												case CR_8: _sendTime = 642;
														break;
											}
											break;
							case BW_500:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 374;
														break;
												case CR_6: _sendTime = 396;
														break;
												case CR_7: _sendTime = 418;
														break;
												case CR_8: _sendTime = 441;
														break;
											}
											break;
						}
						break;

			case SF_10:	switch(_bandwidth)
						{	// Choosing bandwidth
							case BW_125:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 1226;
														break;
												case CR_6: _sendTime = 1388;
														break;
												case CR_7: _sendTime = 1552;
														break;
												case CR_8: _sendTime = 1716;
														break;
											}
											break;
							case BW_250:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 732;
														break;
												case CR_6: _sendTime = 815;
														break;
												case CR_7: _sendTime = 896;
														break;
												case CR_8: _sendTime = 977;
														break;
											}
											break;
							case BW_500:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 486;
														break;
												case CR_6: _sendTime = 527;
														break;
												case CR_7: _sendTime = 567;
														break;
												case CR_8: _sendTime = 608;
														break;
											}
											break;
						}
						break;

			case SF_11:	switch(_bandwidth)
						{	// Choosing bandwidth
							case BW_125:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 2375;
														break;
												case CR_6: _sendTime = 2735;
														break;
												case CR_7: _sendTime = 3095;
														break;
												case CR_8: _sendTime = 3456;
														break;
											}
											break;
							case BW_250:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 1144;
														break;
												case CR_6: _sendTime = 1291;
														break;
												case CR_7: _sendTime = 1437;
														break;
												case CR_8: _sendTime = 1586;
														break;
											}
											break;
							case BW_500:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 691;
														break;
												case CR_6: _sendTime = 766;
														break;
												case CR_7: _sendTime = 838;
														break;
												case CR_8: _sendTime = 912;
														break;
											}
											break;
						}
						break;

			case SF_12: switch(_bandwidth)
						{	// Choosing bandwidth
							case BW_125:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 4180;
														break;
												case CR_6: _sendTime = 4836;
														break;
												case CR_7: _sendTime = 5491;
														break;
												case CR_8: _sendTime = 6146;
														break;
											}
											break;
							case BW_250:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 1965;
														break;
												case CR_6: _sendTime = 2244;
														break;
												case CR_7: _sendTime = 2521;
														break;
												case CR_8: _sendTime = 2800;
														break;
											}
											break;
							case BW_500:	switch(_codingRate)
											{	// Choosing coding rate
												case CR_5: _sendTime = 1102;
														break;
												case CR_6: _sendTime = 1241;
														break;
												case CR_7: _sendTime = 1381;
														break;
												case CR_8: _sendTime = 1520;
														break;
											}
											break;
						}
						break;
			default: _sendTime = MAX_TIMEOUT;
		}
	}
	else
	{
		_sendTime = MAX_TIMEOUT;
	}
	delay = ((0.1*_sendTime) + 1);
	_sendTime = (uint16_t) ((_sendTime * 1.2) + (rand()%delay));
	#if (SX1272_debug_mode > 1)
		printf("Timeout to send/receive is: ");
		printf("%d",_sendTime);
		printf("\n");
	#endif
	state = 0;
	return state;
}

