Ebiroll/qemu_esp32/examples/32_lora/components/lora/esp32LoRa.cpp
/*
 Function: Configures the module to transmit information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::sendWithMAXTimeout()
{
	return sendWithTimeout(MAX_TIMEOUT);
}

/*
 Function: Configures the module to transmit information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::sendWithTimeout()
{
	setTimeout();
	return sendWithTimeout(_sendTime);
}

/*
 Function: Configures the module to transmit information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::sendWithTimeout(uint16_t wait)
{
	  uint8_t state = 2;
	  byte value = 0x00;
	  unsigned long previous;

	  #if (SX1272_debug_mode > 1)
		  printf("\n");
	      printf("Starting 'sendWithTimeout'\n");
	  #endif

	 // clearFlags();	// Initializing flags

	  // wait to TxDone flag
	  previous = millis();
	  if( _modem == LORA )
	  { // LoRa mode
		  clearFlags();	// Initializing flags
		  writeRegister(REG_OP_MODE, LORA_TX_MODE);  // LORA mode - Tx

		  value = readRegister(REG_IRQ_FLAGS);
		  // Wait until the packet is sent (TX Done flag) or the timeout expires
		  while ((bitRead(value, 3) == 0) && (millis() - previous < wait))
		  {
			  value = readRegister(REG_IRQ_FLAGS);
			  // Condition to avoid an overflow (DO NOT REMOVE)
			  if( millis() < previous )
			  {
				  previous = millis();
			  }
		  }
		  state = 1;
	  }
	  else
	  { // FSK mode
		  writeRegister(REG_OP_MODE, FSK_TX_MODE);  // FSK mode - Tx

		  value = readRegister(REG_IRQ_FLAGS2);
		  // Wait until the packet is sent (Packet Sent flag) or the timeout expires
		  while ((bitRead(value, 3) == 0) && (millis() - previous < wait))
		  {
			  value = readRegister(REG_IRQ_FLAGS2);
			  // Condition to avoid an overflow (DO NOT REMOVE)
			  if( millis() < previous )
			  {
				  previous = millis();
			  }
		  }
		  state = 1;
	  }
	  if( bitRead(value, 3) == 1 )
	  {
		  state = 0;	// Packet successfully sent
		  #if (SX1272_debug_mode > 1)
			  printf("## Packet successfully sent ##\n");
			  printf("\n");
		  #endif
	  }
	  else
	  {
		  if( state == 1 )
		  {
			  #if (SX1272_debug_mode > 1)
				  printf("** Timeout has expired **\n");
				  printf("\n");
			  #endif
		  }
		  else
		  {
			  #if (SX1272_debug_mode > 1)
				  printf("** There has been an error and packet has not been sent **\n");
				  printf("\n");
			  #endif
		  }
	  }

	  clearFlags();		// Initializing flags
	  return state;
}

/*
 Function: Configures the module to transmit information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::sendPacketMAXTimeout(uint8_t dest, char *payload)
{
	return sendPacketTimeout(dest, payload, MAX_TIMEOUT);
}

/*
 Function: Configures the module to transmit information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::sendPacketMAXTimeout(uint8_t dest,  uint8_t *payload, uint16_t length16)
{
	return sendPacketTimeout(dest, payload, length16, MAX_TIMEOUT);
}

/*
 Function: Configures the module to transmit information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::sendPacketTimeout(uint8_t dest, char *payload)
{
	uint8_t state = 2;

	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'sendPacketTimeout'\n");
	#endif

	state = setPacket(dest, payload);	// Setting a packet with 'dest' destination
	if (state == 0)								// and writing it in FIFO.
	{
		state = sendWithTimeout();	// Sending the packet
	}
	return state;
}

/*
 Function: Configures the module to transmit information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::sendPacketTimeout(uint8_t dest, uint8_t *payload, uint16_t length16)
{
	uint8_t state = 2;
	uint8_t state_f = 2;

	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'sendPacketTimeout'\n");
	#endif

	state = truncPayload(length16);
	if( state == 0 )
	{
		state_f = setPacket(dest, payload);	// Setting a packet with 'dest' destination
	}												// and writing it in FIFO.
	else
	{
		state_f = state;
	}
	if( state_f == 0 )
	{
		state_f = sendWithTimeout();	// Sending the packet
	}
	return state_f;
}

/*
 Function: Configures the module to transmit information.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::sendPacketTimeout(uint8_t dest, char *payload, uint16_t wait)
{
	uint8_t state = 2;

	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'sendPacketTimeout'\n");
	#endif

	state = setPacket(dest, payload);	// Setting a packet with 'dest' destination
	if (state == 0)								// and writing it in FIFO.
	{
		state = sendWithTimeout(wait);	// Sending the packet
	}
	return state;
}

