Ebiroll/qemu_esp32/examples/32_lora/components/lora/esp32LoRa.cpp
	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'getACK'\n");
	#endif

    previous = millis();

	if( _modem == LORA )
	{ // LoRa mode
	    value = readRegister(REG_IRQ_FLAGS);
		// Wait until the ACK is received (RxDone flag) or the timeout expires
		while ((bitRead(value, 6) == 0) && (millis() - previous < wait))
		{
			value = readRegister(REG_IRQ_FLAGS);
			if( millis() < previous )
			{
				previous = millis();
			}
		}
		if( bitRead(value, 6) == 1 )
		{ // ACK received
			a_received = true;
		}
		// Standby para minimizar el consumo
		writeRegister(REG_OP_MODE, LORA_STANDBY_MODE);	// Setting standby LoRa mode
	}
	else
	{ // FSK mode
		value = readRegister(REG_IRQ_FLAGS2);
		// Wait until the packet is received (RxDone flag) or the timeout expires
		while ((bitRead(value, 2) == 0) && (millis() - previous < wait))
		{
			value = readRegister(REG_IRQ_FLAGS2);
			if( millis() < previous )
			{
				previous = millis();
			}
		}
		if( bitRead(value, 2) == 1 )
		{ // ACK received
			a_received = true;
		}
		// Standby para minimizar el consumo
		writeRegister(REG_OP_MODE, FSK_STANDBY_MODE);	// Setting standby FSK mode
	}

	if( a_received )
	{
		// Storing the received ACK
		ACK.dst = _destination;
		ACK.src = readRegister(REG_FIFO);
		ACK.packnum = readRegister(REG_FIFO);
		ACK.length = readRegister(REG_FIFO);
		ACK.data[0] = readRegister(REG_FIFO);

		// Checking the received ACK
		if( ACK.dst == packet_sent.src )
		{
			if( ACK.src == packet_sent.dst )
			{
				if( ACK.packnum == packet_sent.packnum )
				{
					if( ACK.length == 0 )
					{
						if( ACK.data[0] == CORRECT_PACKET )
						{
							state = 0;
							#if (SX1272_debug_mode > 0)
								// Printing the received ACK
								printf("## ACK received:\n");
								printf("Destination: ");
								printf("%d\n", ACK.dst);			 	// Printing destination
								printf("Source: ");
								printf("%d\n", ACK.src);			 	// Printing source
								printf("ACK number: ");
								printf("%d\n", ACK.packnum);			// Printing ACK number
								printf("ACK length: ");
								printf("%d\n", ACK.length);				// Printing ACK length
								printf("ACK payload: ");
								printf("%d\n", ACK.data[0]);			// Printing ACK payload
								printf(" ##\n");
								printf("\n");
							#endif
						}
						else
						{
							state = 1;
							#if (SX1272_debug_mode > 0)
								printf("** N-ACK received **\n");
								printf("\n");
							#endif
						}
					}
					else
					{
						state = 1;
						#if (SX1272_debug_mode > 0)
							printf("** ACK length incorrectly received **\n");
							printf("\n");
						#endif
					}
				}
				else
				{
					state = 1;
					#if (SX1272_debug_mode > 0)
						printf("** ACK number incorrectly received **\n");
						printf("\n");
					#endif
				}
			}
			else
			{
				state = 1;
				#if (SX1272_debug_mode > 0)
					printf("** ACK source incorrectly received **\n");
					printf("\n");
				#endif
			}
		}
		else
		{
			state = 1;
			#if (SX1272_debug_mode > 0)
				printf("** ACK destination incorrectly received **\n");
				printf("\n");
			#endif
		}
	}
	else
	{
		state = 1;
		#if (SX1272_debug_mode > 0)
			printf("** ACK lost **\n");
			printf("\n");
		#endif
	}
	clearFlags();	// Initializing flags
	return state;
}

/*
 Function: Configures the module to transmit information with retries in case of error.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::sendPacketMAXTimeoutACKRetries(uint8_t dest, char  *payload)
{
	return sendPacketTimeoutACKRetries(dest, payload, MAX_TIMEOUT);
}

/*
 Function: Configures the module to transmit information with retries in case of error.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::sendPacketMAXTimeoutACKRetries(uint8_t dest, uint8_t *payload, uint16_t length16)
{
	return sendPacketTimeoutACKRetries(dest, payload, length16, MAX_TIMEOUT);
}

/*
 Function: Configures the module to transmit information with retries in case of error.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::sendPacketTimeoutACKRetries(uint8_t dest, char *payload)
{
	uint8_t state = 2;

	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'sendPacketTimeoutACKRetries'\n");
	#endif

	// Sending packet to 'dest' destination and waiting an ACK response.
	state = 1;
	while( (state != 0) && (_retries <= _maxRetries) )
	{
		state = sendPacketTimeoutACK(dest, payload);
		_retries++;
	}
	_retries = 0;

	return state;
}

/*
 Function: Configures the module to transmit information with retries in case of error.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::sendPacketTimeoutACKRetries(uint8_t dest, uint8_t *payload, uint16_t length16)
{
	uint8_t state = 2;

	#if (SX1272_debug_mode > 1)
		printf("\n");
		printf("Starting 'sendPacketTimeoutACKRetries'\n");
	#endif

	// Sending packet to 'dest' destination and waiting an ACK response.
	state = 1;
	while((state != 0) && (_retries <= _maxRetries))
	{
		state = sendPacketTimeoutACK(dest, payload, length16);
		_retries++;

	}
	_retries = 0;

	return state;
}

/*
 Function: Configures the module to transmit information with retries in case of error.
 Returns: Integer that determines if there has been any error
   state = 2  --> The command has not been executed
   state = 1  --> There has been an error while executing the command
   state = 0  --> The command has been executed with no errors
*/
uint8_t SX1272::sendPacketTimeoutACKRetries(uint8_t dest, char *payload, uint16_t wait)
{
	uint8_t state = 2;

